In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("income.csv", skiprows=[0], names=["name",

SyntaxError: unexpected EOF while parsing (3248143051.py, line 1)

In [4]:
df = pd.read_csv("income.csv", skiprows=[0], names=["name","income"])

In [5]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [6]:
pwd

'F:\\Education\\DS_Roadmap\\stats'

In [7]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [8]:
df.income.quantile(0.75)

7750.0

In [10]:
df.income.quantile(0.75,interpolation="lower")

7500

In [11]:
df.income.quantile(0.75,interpolation="higher")

8000

In [12]:
df.income.quantile(1)

10000000.0

In [13]:
percentile_99 = df.income.quantile(0.99)

In [14]:
percentile_99

9400479.999999994

In [15]:
df[df.income>percentile_99]

        name    income
6  Elon Musk  10000000

In [16]:
df_no_outlier = df[df.income<=percentile_99]

In [17]:
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [18]:
df['income']

0        5000
1        6000
2        4000
3        7500
4        8000
5        7000
6    10000000
Name: income, dtype: int64

In [19]:
df['income'][3]

7500

In [20]:
df['income'][3]= np.NaN

C:\Users\Aditya Zarekar\AppData\Local\Temp\ipykernel_2916\2467356903.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]= np.NaN

In [21]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [22]:
df.income.mean()

1671666.6666666667

In [23]:
df_new = df.fillna(df.income.mean())

In [24]:
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [25]:
df_new  = df.fillna(df.income.median())

In [26]:
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [27]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [28]:
df.income

0        5000.0
1        6000.0
2        4000.0
3           NaN
4        8000.0
5        7000.0
6    10000000.0
Name: income, dtype: float64

In [30]:
df.mean()

C:\Users\Aditya Zarekar\AppData\Local\Temp\ipykernel_2916\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

income    1.671667e+06
dtype: float64